# 라이브러리
import pandas as pd

# 데이터 불러오기
path = 'C:/Users/admin/Desktop/미니 프로젝트 1/전입전출인구.csv'
df = pd.read_csv(path)

# 확인하기
df

# 이상한 컬럼 제거하기 : Unnamed: 14
df = df.drop(['Unnamed: 14', '단위'], axis = 1)

# 안 쓰는 행 제거하기 : '행정구역(시군구)별'컬럼의 값이 '전국'인 행
df = df[(df['행정구역(시군구)별'] != '전국')]

# 특정 행만 추출하기 : '연령'컬럼의 값이  '20 - 24세', '25 - 29세', '30 - 34세'인 행
df = df[(df['연령별'] == '20 - 24세') | (df['연령별'] == '25 - 29세') | (df['연령별'] == '30 - 34세')]

# 특정 행만 추출하기 : '항목'컬럼의 값이 '순이동(전입- 전출)'인 행
df = df[(df['항목'] == '순이동[명]')]

# 그룹하기 : '행정구역(시군구)별'
df = df.groupby('행정구역(시군구)별').sum()

# 컬럼명 변경하기 : '행정구역(시군구)별' -> '지역'
df = df.rename(columns = {'행정구역(시군구)별' : '지역'})

# 확인 : 10년간의 청년층의 순이동
df